// src/constants/codeMaps.ts

export const areaCodeMap: Record<number, string> = {
  1: "서울",
  2: "인천",
  3: "대전",
  4: "대구",
  5: "광주",
  6: "부산",
  7: "울산",
  8: "세종",
  31: "경기도",
  32: "강원도",
  33: "충청도",
  34: "충청도",
  35: "경상도",
  36: "경상도",
  37: "전라도",
  38: "전라도",
  39: "제주도",
};

export const cat3Map: Record<string, string> = {
  B02010100: "호텔",
  B02010500: "콘도",
  B02010600: "유스호스텔",
  B02010700: "펜션",
  B02010900: "모텔",
  B02011000: "민박",
  B02011100: "게스트하우스",
  B02011200: "홈스테이",
  B02011300: "레지던스",
  B02011600: "한옥",
};
